# Этот класс описывает правило генерации текстовых данных с помощью регулярных выражений.
# Он используется генератором моделей (например, `RandomModelGenerator`), чтобы знать,
# по какому именно шаблону (regex) автоматически создавать случайные строки (email, имена, телефоны).

# Импортируем декоратор dataclass, который автоматически создаст конструктор __init__ для класса.
from dataclasses import dataclass

# Декоратор превращает класс в легкую структуру данных для хранения правил.
@dataclass
class CreationRule:
    # Переменная 'regex' хранит строковое регулярное выражение (шаблон), которому должно соответствовать сгенерированное поле.
    regex: str


