from typing import Protocol, Optional
from src.main.api.models.mentor.base_model import BaseModel
from requests import Response

# Описывает контракт (интерфейс) для CRUD-эндпоинтов.
# Обеспечивает строгую типизацию (через mypy/IDE) и полиморфизм:
# гарантирует, что все клиенты эндпоинтов имеют одинаковые методы
# без жесткого наследования абстрактных классов


# ЗАЧЕМ НУЖЕН ЭТОТ ФАЙЛ / ФРАГМЕНТ:
# Этот файл задает строгий "контракт" (интерфейс) для всех будущих классов-клиентов (ревестеров).
# Благодаря протоколу, любой класс, реализующий методы post, get и delete с такими типами,
# автоматически считается подходящим эндпоинтом, что делает архитектуру гибкой и исключает жесткое наследование.

# Объявляем протокол (структурный интерфейс) для CRUD-операций, описывающий обязательный набор методов класса.
class CrudEndpoint(Protocol):

    # Описываем сигнатуру для метода POST: принимает модель запроса, возвращает либо Pydantic-модель, либо сырой Response.
    def post(self, model: Optional[BaseModel]) -> BaseModel | Response: ...

    # Описываем сигнатуру для метода GET: принимает уникальный ID пользователя, возвращает валидированную модель или сырой ответ.
    def get(self, user_id: int) -> BaseModel | Response: ...

    # Описываем сигнатуру для метода DELETE: принимает ID для удаления, возвращает результат в виде модели или объекта Response.
    def delete(self, user_id: int) -> BaseModel | Response: ...

