# отвечает этот файл за логику,который делал реквестер
from src.main.api.foundation.endpoint import Endpoint
from typing import Dict, Callable

# Базовый движок (клиент) для отправки HTTP-запросов.
# Инкапсулирует логику работы с сессией, заголовками и эндпоинтами,
# автоматически связывая конфигурацию ручки с отправкой данных.

# ЗАЧЕМ НУЖЕН ЭТОТ ФАЙЛ / ФРАГМЕНТ:
# Это базовый класс-контейнер для хранения параметров конкретного HTTP-запроса.
# Он связывает воедино конфигурацию эндпоинта (URL и модели) с правилами ментора
# для отправки (заголовки) и проверки (валидаторы ответов), выступая фундаментом для реквестеров.

# Базовый класс, который собирает и хранит спецификации и целевой эндпоинт для выполнения запросов.
class HTTPRequester:

    # Конструктор принимает заголовки (Dict), целевой эндпоинт (Endpoint) и функцию проверки ответа (Callable).
    def __init__(self, request_specs_mentor: Dict, endpoint: Endpoint, response_specs_mentor: Callable):
        # Сохраняем переданный словарь с заголовками (например, токены авторизации), очищенный от логики URL.
        self.request_specs_mentor = request_specs_mentor

        # Сохраняем объект конкретного эндпоинта из Enum для доступа к его путям и Pydantic-моделям.
        self.endpoint = endpoint

        # Сохраняем функцию-валидатор, которая будет автоматически проверять статус-коды ответов сервера.
        self.response_specs_mentor = response_specs_mentor
